code-review/NRB_3471_3546/База_Было/Reports/ОтчетПоКомиссиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ОтчетПоКомиссиям</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатыФормирования</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьФаксимилеВОтчетах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НД_ИНД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/УслугиДепозитария.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УслугиДепозитария</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСделки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выгодоприобретатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/РазделыСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РазделыСчетаДепо</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СчетаДепо</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерПоручения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийКодНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияОткрытияСчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазделаСчетаДЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСубклиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субклиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЗакрытияРаздела</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПоПредписаниюБР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Reports/ОтчетПоКомиссиям/Ext/ObjectModule.bsl
Процедура СформироватьОтчеты(ДепонентыСписок) Экспорт
	// Таблица для хранения отчетов
	ТЗ	= Новый ТаблицаЗначений;
	
	ТЗ.Колонки.Добавить("Клиент");
	ТЗ.Колонки.Добавить("ОтчетАдрес");
	
	Запрос = Новый Запрос;
	Если НД_ИНД = Истина Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УслугиДепозитарияУслуги.Ссылка.Контрагент КАК ИнициаторВладелец,
		|	УслугиДепозитарияУслуги.Ссылка.Договор КАК Инициатор,
		|	УслугиДепозитарияУслуги.Ссылка КАК Документ,
		|	УслугиДепозитарияУслуги.Валюта КАК Валюта,
		|	УслугиДепозитарияУслуги.МестоХранения КАК МестоХранения,
		|	УслугиДепозитарияУслуги.СуммаСделки КАК СуммаСделки,
		|	УслугиДепозитарияУслуги.СуммаКомиссии КАК СуммаКомиссии,
		|	УслугиДепозитарияУслуги.Выгодоприобретатель КАК Выгодоприобретатель,
		|	УслугиДепозитарияУслуги.Ссылка.ПериодРасчетаКомиссии КАК ПериодНачисления,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(УслугиДепозитарияУслуги.СуммаСделки, 0) / (РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(УслугиДепозитарияУслуги.Ссылка.ПериодРасчетаКомиссии, МЕСЯЦ), КОНЕЦПЕРИОДА(УслугиДепозитарияУслуги.Ссылка.ПериодРасчетаКомиссии, МЕСЯЦ), ДЕНЬ) + 1) КАК ЧИСЛО(20, 2)) КАК СреднедневнаяСтоимостьОстатка,
		|	УслугиДепозитарияУслуги.Услуга КАК Услуга,
		|	УслугиДепозитарияУслуги.Ссылка.Дата КАК ПериодДокумента,
		|	СчетаДепо.Ссылка КАК СчетДЕПО,
		|	УслугиДепозитарияУслуги.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ втИсходнаяТаблица
		|ИЗ
		|	Документ.УслугиДепозитария.Услуги КАК УслугиДепозитарияУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
		|			ПО СчетаДепо.Ссылка = РазделыСчетаДепо.Владелец
		|				И (РазделыСчетаДепо.РазделСчетаДепоМХ.Код = ""00000000000000000"")
		|		ПО УслугиДепозитарияУслуги.Ссылка.Контрагент = СчетаДепо.Владелец
		|ГДЕ
		|	УслугиДепозитарияУслуги.Ссылка.Проведен
		|	И УслугиДепозитарияУслуги.Ссылка.Дата МЕЖДУ &ПериодНачало И &ПериодКонец
		|	И УслугиДепозитарияУслуги.СуммаКомиссии <> 0
		|	И УслугиДепозитарияУслуги.Ссылка.Контрагент В(&СписокКлиентов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИсходнаяТаблица.ИнициаторВладелец КАК ИнициаторВладелец,
		|	втИсходнаяТаблица.Инициатор КАК Инициатор,
		|	втИсходнаяТаблица.Валюта КАК Валюта,
		|	СУММА(втИсходнаяТаблица.СуммаСделки) КАК СуммаСделки,
		|	СУММА(втИсходнаяТаблица.СуммаКомиссии) КАК СуммаВВалютеПриход,
		|	втИсходнаяТаблица.Выгодоприобретатель КАК Выгодоприобретатель,
		|	втИсходнаяТаблица.ПериодНачисления КАК ПериодНачисления,
		|	СУММА(втИсходнаяТаблица.СреднедневнаяСтоимостьОстатка) КАК СреднедневнаяСтоимостьОстатка,
		|	втИсходнаяТаблица.Услуга КАК Услуга,
		|	втИсходнаяТаблица.ПериодДокумента КАК Период,
		|	РазделыСчетаДепо.Код КАК КодРазделаСчетаДЕПО
		|ИЗ
		|	втИсходнаяТаблица КАК втИсходнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
		|		ПО втИсходнаяТаблица.СчетДЕПО = РазделыСчетаДепо.Владелец
		|			И (ВЫБОР
		|				КОГДА втИсходнаяТаблица.ИнициаторВладелец.Субброкер
		|					ТОГДА втИсходнаяТаблица.Выгодоприобретатель = РазделыСчетаДепо.Субклиент
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|			И (РазделыСчетаДепо.РазделСчетаДепоМХ.Код = ""00000000000000000"")
		|
		|СГРУППИРОВАТЬ ПО
		|	втИсходнаяТаблица.СчетДЕПО,
		|	втИсходнаяТаблица.ИнициаторВладелец,
		|	втИсходнаяТаблица.Услуга,
		|	втИсходнаяТаблица.Инициатор,
		|	втИсходнаяТаблица.ПериодДокумента,
		|	РазделыСчетаДепо.Ссылка,
		|	втИсходнаяТаблица.Выгодоприобретатель,
		|	втИсходнаяТаблица.ПериодНачисления,
		|	втИсходнаяТаблица.Валюта,
		|	РазделыСчетаДепо.Код
		|
		|УПОРЯДОЧИТЬ ПО
		|	втИсходнаяТаблица.Выгодоприобретатель.Наименование
		|ИТОГИ
		|	СУММА(СуммаСделки),
		|	СУММА(СуммаВВалютеПриход),
		|	СУММА(СреднедневнаяСтоимостьОстатка)
		|ПО
		|	ИнициаторВладелец,
		|	Инициатор";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УслугиДепозитарияОбороты.Инициатор.Владелец КАК ИнициаторВладелец,
		|	УслугиДепозитарияОбороты.Инициатор КАК Инициатор,
		|	ВЫРАЗИТЬ(УслугиДепозитарияОбороты.Регистратор КАК Документ.УслугиДепозитария).ПериодРасчетаКомиссии КАК ПериодНачисления,
		|	УслугиДепозитарияОбороты.Период КАК Период,
		|	УслугиДепозитарияОбороты.Услуга КАК Услуга,
		|	УслугиДепозитарияОбороты.Валюта КАК Валюта,
		|	СУММА(УслугиДепозитарияОбороты.СуммаВВалютеПриход) КАК СуммаВВалютеПриход
		|ИЗ
		|	РегистрНакопления.УслугиДепозитария.Обороты(&ПериодНачало, &ПериодКонец, Регистратор, Инициатор.Владелец В (&СписокКлиентов)) КАК УслугиДепозитарияОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	УслугиДепозитарияОбороты.Инициатор.Владелец,
		|	УслугиДепозитарияОбороты.Инициатор,
		|	ВЫРАЗИТЬ(УслугиДепозитарияОбороты.Регистратор КАК Документ.УслугиДепозитария).ПериодРасчетаКомиссии,
		|	УслугиДепозитарияОбороты.Услуга,
		|	УслугиДепозитарияОбороты.Валюта,
		|	УслугиДепозитарияОбороты.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	ИнициаторВладелец,
		|	Инициатор,
		|	ПериодНачисления,
		|	Услуга
		|ИТОГИ
		|	СУММА(СуммаВВалютеПриход)
		|ПО
		|	ИнициаторВладелец,
		|	Инициатор";
	КонецЕсли;

	Запрос.УстановитьПараметр("ПериодКонец", ?(НД_ИНД = Истина, КонецДня(ПериодКонец), Новый Граница(КонецДня(ПериодКонец), ВидГраницы.Включая)));
	Запрос.УстановитьПараметр("ПериодНачало", ?(НД_ИНД = Истина, НачалоДня(ПериодНачало), Новый Граница(НачалоДня(ПериодНачало), ВидГраницы.Включая)));
	Запрос.УстановитьПараметр("СписокКлиентов", ДепонентыСписок);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	ИначеЕсли НД_ИНД = Истина Тогда
		Макет = ПолучитьМакет("Макет_НД_ИНД_2022");
	Иначе
		Макет = ПолучитьМакет("Макет_2022");
	КонецЕсли;
	Организация	= Константы.ОрганизацияПоУмолчанию.Получить();
	ДолжностьНачальникаДепозитария	= Справочники.ДолжностиОрганизаций.НайтиПоНаименованию("Начальник депозитария");
	ВалютаРегламентированногоУчета = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ВалютаРегламентированногоУчета");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|			&ДатаФормирования,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И Должность = &Должность
	|				И ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.УполномоченныйПредставитель))";

	Запрос.УстановитьПараметр("ДатаФормирования"	, ДатаФормирования);
	Запрос.УстановитьПараметр("Должность"			, ДолжностьНачальникаДепозитария);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, Организация);
	
	ОтветственныеЛица = Запрос.Выполнить().Выгрузить();
	
	Если ОтветственныеЛица.Количество() > 0 Тогда
		ДанныеФЛ		= ОбщегоНазначения.ДанныеФизЛица(Справочники.Организации.ПустаяСсылка(), ОтветственныеЛица[0].ФизическоеЛицо, ДатаФормирования);
		Ответственный	= ОбщегоНазначения.ПолучитьФамилиюИмяОтчество(ДанныеФЛ.Фамилия, ДанныеФЛ.Имя, ДанныеФЛ.Отчество);
	Иначе
		Ответственный	= "";
	КонецЕсли;	
	// Получим данные "исполнителя"
	Пользователь		= ПараметрыСеанса.ТекущийПользователь;
	ИсполнительФЛ		= Пользователь.ФизЛицо;
	ИсполнительФЛДанные	= ОбщегоНазначения.ДанныеФизЛица(Справочники.Организации.ПустаяСсылка(), ИсполнительФЛ, ДатаФормирования);
	Исполнитель			= ОбщегоНазначения.ПолучитьФамилиюИмяОтчество(ИсполнительФЛДанные.Фамилия, ИсполнительФЛДанные.Имя, ИсполнительФЛДанные.Отчество);
	ИсполнительТелефон	= СокрЛП(РегистрыСведений.КонтактнаяИнформация.ПолучитьПоследнее(, Новый Структура("Объект, Тип, Вид", Пользователь, Перечисления.ТипыКонтактнойИнформации.Телефон				, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя))["Представление"]);
	ИсполнительПочта	= СокрЛП(РегистрыСведений.КонтактнаяИнформация.ПолучитьПоследнее(, Новый Структура("Объект, Тип, Вид", Пользователь, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты	, Справочники.ВидыКонтактнойИнформации.EmailПользователя))["Представление"]);
	
	ТекстСообщенияПользователю = "";

	// Выбираем клиентов
	ВыборкаКлиенты	= Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКлиенты.Следующий() Цикл
		// Открываем выборку по договорам
		ВыборкаДоговора	= ВыборкаКлиенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДоговора.Следующий() Цикл
			// Создадим Табличный документ для формирования отчета по клиенту
			ТД		= Новый ТабличныйДокумент;
			Шапка	= Макет.ПолучитьОбласть("Шапка");
			
			НаименованиеКлиентаДляПечати = ?(ЗначениеЗаполнено(СокрЛП(ВыборкаКлиенты.ИнициаторВладелец.НаименованиеПолное)), СокрЛП(ВыборкаКлиенты.ИнициаторВладелец.НаименованиеПолное), СокрЛП(ВыборкаКлиенты.ИнициаторВладелец.Наименование));
			Шапка.Параметры.КлиентНаименованиеПолное		= НаименованиеКлиентаДляПечати;
			Шапка.Параметры.ИнформацияПоДепоДоговоруКлиента	= "Депозитарный договор № " + ВыборкаДоговора.Инициатор.Код + " от " + Формат(ВыборкаДоговора.Инициатор.ДатаНачалоДействия, "ДФ=dd.MM.yyyy") + " г.";
			Шапка.Параметры.НаименованиеКомпании			= СокрЛП(Организация.Наименование);
			Шапка.Параметры.ИННКППКомпании					= "ИНН "+СокрЛП(Организация.ИНН) + " / КПП "+СокрЛП(Организация.КПП);
			Шапка.Параметры.ЮрАдресКомпании					= СокрЛП(РегистрыСведений.КонтактнаяИнформация.ПолучитьПоследнее(, Новый Структура("Объект, Тип, Вид", Организация, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации))["Представление"]);
			Шапка.Параметры.НомерИДатаИсходящего			= Формат(ДатаФормирования, "ДФ='dd MMMM yyyy'") + " года";
			Шапка.Параметры.НаименованиеКомпанииПолное		= ?(ЗначениеЗаполнено(СокрЛП(Организация.НаименованиеПолное)), СокрЛП(Организация.НаименованиеПолное), СокрЛП(Организация.Наименование));
			
			ТД.Вывести(Шапка);
			// Выборка по данным строк
			ВыборкаСтрок = ВыборкаДоговора.Выбрать();
			НомерСтроки = 1;
			Пока ВыборкаСтрок.Следующий() Цикл
				ПериодДляИтогов	= ВыборкаСтрок.Период;
				ВалютаДляИтогов	= ВыборкаСтрок.Валюта;
				
				Строка = Макет.ПолучитьОбласть("Строка");
				
				Строка.Параметры.НаименованиеУслуги	= ВыборкаСтрок.Услуга;
				Строка.Параметры.Период				= ВыборкаСтрок.ПериодНачисления;
				Строка.Параметры.СтоимостьУслуги	= ВыборкаСтрок.СуммаВВалютеПриход;
				Строка.Параметры.ДатаНачисления		= ВыборкаСтрок.Период;
				
				Если НД_ИНД = Истина Тогда 
					Строка.Параметры.НомерСтроки = НомерСтроки;
					Строка.Параметры.Субклиент = ВыборкаСтрок.Выгодоприобретатель;
					Строка.Параметры.КодРазделаСчетаДЕПО = СтрЗаменить(ВыборкаСтрок.КодРазделаСчетаДЕПО, "О", "");
					Строка.Параметры.СреднедневнаяСтоимостьОстатка = ВыборкаСтрок.СреднедневнаяСтоимостьОстатка;
					Строка.Параметры.Валюта	=?(ВыборкаСтрок.Валюта = ВалютаРегламентированногоУчета, "RUB", ВыборкаСтрок.Валюта);
					НомерСтроки = НомерСтроки + 1;
					Если НЕ ЗначениеЗаполнено (Строка.Параметры.Субклиент) И ВыборкаКлиенты.ИнициаторВладелец.Субброкер Тогда
						ТекстСообщенияПользователю = ТекстСообщенияПользователю + "У клиента " + НаименованиеКлиентаДляПечати + " по сумме комиссии " + Строка.Параметры.СтоимостьУслуги + " не указан субклиент." + Символы.ПС;
					КонецЕсли;

				Иначе
					Строка.Параметры.Валюта	= ВыборкаСтрок.Валюта;
				КонецЕсли;
				
				ТД.Вывести(Строка);
			КонецЦикла;
			Подвал	= Макет.ПолучитьОбласть("Подвал");
			
			Подвал.Параметры.ИтогоСтоимостьУслуг = ВыборкаДоговора.СуммаВВалютеПриход;
			
			Если НД_ИНД = Истина Тогда  
				Подвал.Параметры.Валюта	= ?(ВалютаДляИтогов = ВалютаРегламентированногоУчета, "RUB", ВалютаДляИтогов);
				Подвал.Параметры.ИтогоСреднедневнаяСтоимостьОстатка = ВыборкаДоговора.СреднедневнаяСтоимостьОстатка;
			Иначе
				Подвал.Параметры.Валюта	= ВалютаДляИтогов;
			КонецЕсли;
			
			Подвал.Параметры.ДолжностьОтветственного	= ДолжностьНачальникаДепозитария;
			Подвал.Параметры.Ответственный				= Ответственный;
			// Получить факсимилье
			Если ВыводитьФаксимилеВОтчетах Тогда
				ФормированиеПечатныхФорм.ПолучитьФаксимилье(ИсполнительФЛ, Подвал.Рисунки.Faksimilie.Картинка);
			Иначе
				Подвал.Рисунки.Faksimilie.Картинка	= Новый Картинка;
			КонецЕсли;
			// Пользователь кто сформировал
			ФИОИсполнителя		= Исполнитель;
			ТелефонИсполнителя	= ИсполнительТелефон;
			ПочтаИсполнителя	= ИсполнительПочта;
			
			Подвал.Параметры.НижнийКолонтитул = ФИОИсполнителя + "; тел: "+ТелефонИсполнителя + "; e-mail: " + ПочтаИсполнителя;
			
			ТД.Вывести(Подвал);
			
			ТД.ОтображатьЗаголовки	= Ложь;
			ТД.ОтображатьСетку		= Ложь;
			
			НовыйОтчет	= ТЗ.Добавить();
			
			НовыйОтчет.Клиент		= ВыборкаКлиенты.ИнициаторВладелец;
			НовыйОтчет.ОтчетАдрес	= ПоместитьВоВременноеХранилище(ТД);
		КонецЦикла;
	КонецЦикла;
	
	РезультатыФормирования	= ТЗ.Скопировать();
	
	Если ТекстСообщенияПользователю <> "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщенияПользователю;
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
